In [1]:
import pandas as pd
import sqlite3

In [13]:
data = [
  {
    "name": "New York",
    "location": [40.7128, -74.0059],
    "population": 8804190
  },
  {
    "name": "Chicago",
    "location": [41.8781, -87.6298],
    "population": 2746388
  },
  {
    "name": "Houston",
    "location": [29.7604, -95.3698],
    "population": 2304580
  },
  {
    "name": "Los Angeles",
    "location": [34.0522, -118.2437],
    "population": 3898747
  },
  {
    "name": "Omaha",
    "location": [41.2524, -95.9980],
    "population": 486051
  }
]

data_df = pd.DataFrame(data)
data_df["rowid"] = data_df.index
data_df["lat"] = data_df.location.apply(lambda x: x[0])
data_df["lon"] = data_df.location.apply(lambda x: x[1])
data_df.drop("location",axis=1,inplace=True)
data_df.head(10)

          name  population  rowid      lat       lon
0     New York     8804190      0  40.7128  -74.0059
1      Chicago     2746388      1  41.8781  -87.6298
2      Houston     2304580      2  29.7604  -95.3698
3  Los Angeles     3898747      3  34.0522 -118.2437
4        Omaha      486051      4  41.2524  -95.9980

In [15]:
cnxn = sqlite3.connect(r"data/cities.sqlite")
crsr = cnxn.cursor()

create_statement = """
CREATE TABLE cities (
rowid integer PRIMARY KEY,
name text,
population integer,
lat real,
lon real
);
"""
crsr.execute(create_statement)
data_df.to_sql("cities",cnxn,index=False, if_exists="append")

cnxn.close()

In [17]:
data_df.to_dict('split')

{'index': [0, 1, 2, 3, 4],
 'columns': ['name', 'population', 'rowid', 'lat', 'lon'],
 'data': [['New York', 8804190, 0, 40.7128, -74.0059],
  ['Chicago', 2746388, 1, 41.8781, -87.6298],
  ['Houston', 2304580, 2, 29.7604, -95.3698],
  ['Los Angeles', 3898747, 3, 34.0522, -118.2437],
  ['Omaha', 486051, 4, 41.2524, -95.998]]}